```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github-repository.github_actions_secret.main["google_service_account_id"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "google_service_account_id"
      + updated_at      = (known after apply)
    }

  # module.github-repository.github_actions_secret.main["google_workload_identity"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "google_workload_identity"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->